# DBMS

In [1]:
import sqlite3

Working With Database using SQL (Structured Query Language)

1 Create a Connection Object.
2 From The Connection Object, Create a cursor Object.
3 Using The Cursor Obejct, Call execute method with create table query as the parameter.

## Create Database

In [2]:
#student_database will be created in jupyter notebook Home

#First connection object 
dbcon=sqlite3.connect("My_Student_databace.db")

Cursor
A cursor in SQL is a temporary work area created in systme memory when a SQL statement is executed. 
A SQL cursor is a set of rows together with a pointer that identifies a current row.
It is a database object to retrieve data from a result set one row at a time.

In [3]:
cur=dbcon.cursor()

## Create table in Studnet_Databese

SQL Data types ---
integer --- numeric values 
real ------ decimal values
text ------ character values 
char(20) -- character values

In [4]:
cur.execute("create table student(id int primary key,name text, age int)")

## Insert data in student table

In [5]:
cur.execute("insert into student (id,name,age) values(1,'john',28)")
dbcon.commit()

In [6]:
cur.execute("insert into student (id,name,age) values(2,'lalit',26)")

In [7]:
dbcon.commit()

In [8]:
cur.execute("insert into student (id,name,age) values(3,'Babita',26)")
dbcon.commit()

In [9]:
result=cur.execute("select * from student")

for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)

In [10]:
cur.execute("insert into student (id,name,age) values(4,'ram',35)")
dbcon.commit()

In [11]:
cur.execute("insert into student values (5,'sourabh',27),(6,'deepak',25)")
dbcon.commit()

print(cur.rowcount," record (s) inserted")

2  record (s) inserted

In [12]:
cur.execute("insert into student values (8,'karan',28)")
dbcon.commit()
print(cur.rowcount,"record inserted")

1 record inserted

In [13]:
resutl=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [14]:
resutl=cur.execute("select id from student")
for i in result:
    print(i)

(1,)
(2,)
(3,)
(4,)
(5,)
(6,)
(8,)

In [15]:
resutl=cur.execute("select name from student")
for i in result:
    print(i)

('john',)
('lalit',)
('Babita',)
('ram',)
('sourabh',)
('deepak',)
('karan',)

In [16]:
resutl=cur.execute("select age from student")
for i in result:
    print(i)

(28,)
(26,)
(26,)
(35,)
(27,)
(25,)
(28,)

In [17]:
resutl=cur.execute("select id,name from student")
for i in result:
    print(i)

(1, 'john')
(2, 'lalit')
(3, 'Babita')
(4, 'ram')
(5, 'sourabh')
(6, 'deepak')
(8, 'karan')

In [18]:
resutl=cur.execute("select age,name from student")
for i in result:
    print(i)

(28, 'john')
(26, 'lalit')
(26, 'Babita')
(35, 'ram')
(27, 'sourabh')
(25, 'deepak')
(28, 'karan')

In [19]:
resutl=cur.execute("select * from student where id=1")
for i in result:
    print(i)

(1, 'john', 28)

In [20]:
resutl=cur.execute("select * from student where name='lalit'")
for i in result:
    print(i)

(2, 'lalit', 26)

In [21]:
resutl=cur.execute("select * from student where age=28")
for i in result:
    print(i)

(1, 'john', 28)
(8, 'karan', 28)

In [22]:
resutl=cur.execute("select id,age from student where age=28")
for i in result:
    print(i)

(1, 28)
(8, 28)

In [23]:
resutl=cur.execute("select id,age from student where age>28")
for i in result:
    print(i)

(4, 35)

In [24]:
resutl=cur.execute("select id,age from student where age<=28")
for i in result:
    print(i)

(1, 28)
(2, 26)
(3, 26)
(5, 27)
(6, 25)
(8, 28)

In [25]:
resutl=cur.execute("select name from student where age<=26")
for i in result:
    print(i)

('lalit',)
('Babita',)
('deepak',)

In [26]:
result=cur.execute("select * from student")
result.fetchall()

[(1, 'john', 28),
 (2, 'lalit', 26),
 (3, 'Babita', 26),
 (4, 'ram', 35),
 (5, 'sourabh', 27),
 (6, 'deepak', 25),
 (8, 'karan', 28)]

In [27]:
result=cur.execute("select age,name from student where age=28")
result.fetchone()

(28, 'john')

In [28]:
result=cur.execute("select * from student where age>26")
result.fetchall()

[(1, 'john', 28), (4, 'ram', 35), (5, 'sourabh', 27), (8, 'karan', 28)]

In [29]:
result=cur.execute("select * from student where age < 28")
result.fetchall()

[(2, 'lalit', 26), (3, 'Babita', 26), (5, 'sourabh', 27), (6, 'deepak', 25)]

In [30]:
result=cur.execute("select * from student where id in (1,2,3)")
result.fetchall()

[(1, 'john', 28), (2, 'lalit', 26), (3, 'Babita', 26)]

In [31]:
result=cur.execute("select * from student where id in (1,2,3)")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)

In [32]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [33]:
result=cur.execute("select * from student limit 4")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)

In [34]:
result=cur.execute("select * from student where id NOT in (1,2,3)")
for i in result:
    print(i)

(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [35]:
result=cur.execute("select * from student where age>26 and age<35")
for i in result:
    print(i)

(1, 'john', 28)
(5, 'sourabh', 27)
(8, 'karan', 28)

In [36]:
result=cur.execute("select * from student where age=28 or id=5")
for i in result:
    print(i)

(1, 'john', 28)
(5, 'sourabh', 27)
(8, 'karan', 28)

In [37]:
result=cur.execute("select * from student where id=2 and age<28")
for i in result:
    print(i)

(2, 'lalit', 26)

In [38]:
result=cur.execute("select * from student where age<28 and id in (1,2,3)")
for i in result:
    print(i)

(2, 'lalit', 26)
(3, 'Babita', 26)

In [39]:
result=cur.execute("select * from student order by name asc")
for i in result:
    print(i)

(3, 'Babita', 26)
(6, 'deepak', 25)
(1, 'john', 28)
(8, 'karan', 28)
(2, 'lalit', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)

In [40]:
result=cur.execute("select * from student order by name desc")
for i in result:
    print(i)

(5, 'sourabh', 27)
(4, 'ram', 35)
(2, 'lalit', 26)
(8, 'karan', 28)
(1, 'john', 28)
(6, 'deepak', 25)
(3, 'Babita', 26)

In [41]:
result=cur.execute("select * from student order by age asc")
for i in result:
    print(i)

(6, 'deepak', 25)
(2, 'lalit', 26)
(3, 'Babita', 26)
(5, 'sourabh', 27)
(1, 'john', 28)
(8, 'karan', 28)
(4, 'ram', 35)

# Aggregate Functions

MIN -- find minimum
MAX -- find maximum
AVG -- find average
SUM -- find sum
COUNT -- count the number of rows

In [42]:
result=cur.execute("select age from student")
for i in result:
    print(i)

(28,)
(26,)
(26,)
(35,)
(27,)
(25,)
(28,)

In [43]:
result=cur.execute("select min(age) from student" )
for i in result:
    print(i)

(25,)

In [44]:
result=cur.execute("select max(age) from student" )
for i in result:
    print(i)

(35,)

In [45]:
result=cur.execute("select avg(age) from student" )
for i in result:
    print(i)

(27.857142857142858,)

In [46]:
result=cur.execute("select sum(age) from student" )
for i in result:
    print(i)

(195,)

In [47]:
result=cur.execute("select count(id) from student" )
for i in result:
    print(i)

(7,)

In [48]:
result=cur.execute("select sum(age) from student" )
result.fetchall()

[(195,)]

In [49]:
results=cur.execute("Select * from student where age between 20 and 30")

for i in results:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [50]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [51]:
result=cur.execute("select * from student where age is null")
for i in result:
    print(i)

In [52]:
result=cur.execute("select * from student where age is NOT null")
for i in result:
    print(i)

(1, 'john', 28)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

LIKE Operators

In [53]:
results=cur.execute("Select * from student where name like 'L%'")
for i in results:
    print(i)

(2, 'lalit', 26)

In [54]:
results=cur.execute("Select * from student where name like 'b%'")
for i in results:
    print(i)

(3, 'Babita', 26)

In [55]:
results=cur.execute("Select * from student where name like '_a%'")
for i in results:
    print(i)

(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(8, 'karan', 28)

In [56]:
results=cur.execute("Select * from student where name like '%n'")
for i in results:
    print(i)

(1, 'john', 28)
(8, 'karan', 28)

In [57]:
results=cur.execute("Select * from student where name like '%B%'")
for i in results:
    print(i)

(3, 'Babita', 26)
(5, 'sourabh', 27)

In [58]:
results=cur.execute("Select * from student where name like '_a___'")
for i in results:
    print(i)

(2, 'lalit', 26)
(8, 'karan', 28)

In [59]:
results=cur.execute("Select * from student where name like 'k%n'")
for i in results:
    print(i)

(8, 'karan', 28)

In [60]:
results=cur.execute("Select * from student where name like '_____'")
for i in results:
    print(i)

(2, 'lalit', 26)
(8, 'karan', 28)

UPDATE RECORD

In [61]:
sqt="update student set age=27 where id=1"
cur.execute(sqt)
dbcon.commit()

In [62]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'john', 27)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 35)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [63]:
result=cur.execute("select * from student where id=1")
for i in result:
    print(i)

(1, 'john', 27)

In [64]:
sqt="update student set age=29 where id in (1,4)"
cur.execute(sqt)
dbcon.commit()

In [65]:
result=cur.execute("select * from student ")
for i in result:
    print(i)

(1, 'john', 29)
(2, 'lalit', 26)
(3, 'Babita', 26)
(4, 'ram', 29)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [66]:
sqt="update student set age=27 where id in (2,3)"
cur.execute(sqt)
dbcon.commit()
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'john', 29)
(2, 'lalit', 27)
(3, 'Babita', 27)
(4, 'ram', 29)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

## Delete any unwanted records

In [67]:
sql="delete from student where id=1"
cur.execute(sql)
result=cur.execute("select * from student ")
for i in result:
    print(i)

(2, 'lalit', 27)
(3, 'Babita', 27)
(4, 'ram', 29)
(5, 'sourabh', 27)
(6, 'deepak', 25)
(8, 'karan', 28)

In [68]:
sql="delete from student where id=1"
cur.execute(sql)
result=cur.execute("select * from student ")
result.fetchall()

[(2, 'lalit', 27),
 (3, 'Babita', 27),
 (4, 'ram', 29),
 (5, 'sourabh', 27),
 (6, 'deepak', 25),
 (8, 'karan', 28)]

##  ALTER & DROP TABLE STUDENT

In [69]:
sql="alter table student drop age"
cur.execute(sql)
result=cur.execute("select * from student")
result.fetchall()

[(2, 'lalit'),
 (3, 'Babita'),
 (4, 'ram'),
 (5, 'sourabh'),
 (6, 'deepak'),
 (8, 'karan')]

In [70]:
sql="drop table student "
cur.execute(sql)
result=cur.execute("select * from student")
result.fetchall()

OperationalError: no such table: student

In [71]:
dbcon.close()